Repository: mishin/perldoc-ru
Catalog: pod2-ru/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: The following program prints "1" if the program is invoked with a B<-xyz> switch, and "abc" if it is invoked with B<-xyz=abc>.
ru_ru: Следующая программа выводит "1", если программа вызывается с опцией B<-xyz> и "abc" если она вызывается с B<-xyz=abc>.

source: The interaction with the Perl compilation happens inside package C<myint>:
ru_ru: Взаимодействие с Perl во время компиляции внутри пакета C<myint>:

source: The item you want to look up.
ru_ru: Название того, чего хотите найти.

source: The language is intended to be practical (easy to use, efficient, complete) rather than beautiful (tiny, elegant, minimal).
ru_ru: Язык больше предназначен для практических (простота в использовании, эффективность, полнота), чем для красивых решений (крошечность, элегантность, минимализм).

source: The layer provides both buffering and IO.
ru_ru: Слой обеспечивает как буферизации и ввода-вывода.

source: The letters, their numeric values, and effects are as follows; listing the letters is equal to summing the numbers.
ru_ru: Буквы, их числовые значения и эффекты являются следующие перечисление букв равно суммированию чисел.

source: The list becomes the default for I<all> Perl's IO.
ru_ru: Список будет использоваться по умолчанию для I<всех> IO Perl.

source: The major reference book on Perl, written by the creator of Perl, is I<Programming Perl>:
ru_ru: Основной справочник по Perl, написанный создателем Perl, это I<Programming Perl> (Программирование на Perl):

source: The minimal implementation of the package C<MyMaths> would be something like this:
ru_ru: Минимальная реализация пакета C<MyMaths> будет примерно такой:

source: The most well known of these is C<%ENV> which contains environment variables.
ru_ru: Наиболее известным из них является C<%ENV>, который содержит переменные окружения.

source: The normal way to run a Perl program is by making it directly executable, or else by passing the name of the source file as an argument on the command line.
ru_ru: Нормальный способ запуска Perl программы может быть таким или сделать файл его исполняемым, либо, передать имя исходного файла в качестве аргумента в командной строке.

source: The only current differences are:
ru_ru: Только текущей отличия:

source: The only one you need to know about for now is C<$_> which is the "default variable".
ru_ru: Единственное, что вам нужно знать о этом на данный момент, то это про переменную C<$_> которая является "переменной по умолчанию".

source: The order may not be repeatable in a following program run even if the PERL_HASH_SEED has been specified.
ru_ru: Чтобы не может быть повторяемым в следующем запуске программы, даже если PERL_HASH_SEED был указан.

source: The problem is that none of this is reliable: it depends on the command and it is entirely possible neither works.
ru_ru: Проблема в том, что ничто из этого не является надежным: он зависит от команды, и вполне возможно не будет работать.

source: The produced perl script may have subroutines defined to deal with awk's semantics regarding getline and print.
ru_ru: Полученный Perl скрипт может иметь подпрограммы, которые определены иметь дело с семантикой AWK относительно getline и print.

source: The program must be terminated with C<__END__> if there is trailing garbage to be ignored; the program can process any or all of the trailing garbage via the C<DATA> filehandle if desired.
ru_ru: Программа должна быть прекращена с C<__END__> если есть задний мусор должен быть проигнорирован, программа может обрабатывать любой или все из задней мусора через C<DATA> дескриптор файла при желании.

source: The program should instead say:
ru_ru: Программа должна вместо этого сказать:

source: The read-only magic variable C<${^UNICODE}> reflects the numeric value of this setting.
ru_ru: Волшебная переменная только для чтения C<${^UNICODE}> отражает числовое значение данного параметра.

source: The results end up in C<$1>, C<$2> and so on.
ru_ru: Результаты оказались в C<$1>, C<$2> и так далее.

source: The sequences "-*" and "- " are specifically ignored so that you could, if you were so inclined, say
ru_ru: Последовательности "-*" и "- " специально игнорируются, чтобы вы могли их использовать, если вам это нужно, скажем

source: The shell executes the second line as a normal shell command, and thus starts up the Perl interpreter.
ru_ru: Шелл (Shell) выполняет вторую строку как обычную команду shell , и, таким образом запускает интерпретатор Perl.

source: The similarity to the title of the major Perl book (which came later) is not completely accidental:
ru_ru: Сходство на звание крупнейших книжных Perl (которые пришли позже) не является полностью случайным:

source: The special value 00 will cause Perl to slurp files in paragraph mode.
ru_ru: Специальное значение 00 приводят Perl захватывать файлы по параграфам (slurp files in paragraph mode).

source: The special variable C<$#array> tells you the index of the last element of an array:
ru_ru: Специальная переменная C<$#array> говорит вам, индекс последнего элемента массива:

source: The state information in C<%^H> is stored in the optree, and can be retrieved read-only at runtime with C<caller()>, at index 10 of the list of returned results.
ru_ru: Информация о состоянии в C<%^H> сохраняется в op-дереве, и может быть получено во время выполнения с помощью C<caller()>, под индексом 10 в возвращённом списке.

source: The system ignores the first line and feeds the program to F</bin/sh>, which proceeds to try to execute the Perl program as a shell script.
ru_ru: Система игнорирует первую линию и подает программу F</bin/sh>, которая продолжает пробовать выполнить Perl программу как сценарий оболочки.

source: The three principal virtues of a programmer are Laziness, Impatience, and Hubris.
ru_ru: Тремя основные достоинства программиста: лень, нетерпение, и высокомерие.

source: The tutorial started in the Llama continues in the Alpaca, which introduces the intermediate features of references, data structures, object-oriented programming, and modules:
ru_ru: Учебник начатый в Ламе продолжается в Aльпаке, который вводит промежуточные фичи (intermediate features), такие как ссылки, структуры данных, объектно-ориентированного программирование и модули:

source: The two additional lines request from perl to catch various common problems in your code.
ru_ru: Две дополнительных строки требуют от perl ловить различные общие ошибки в вашем коде.

source: The value has the form C<< <I<number>>[m][s][t] >>, where C<I<number>> is the file descriptor number you want to write to (2 is default), and the combination of letters specifies that you want information about (m)emory and/or (s)v, optionally with (t)imestamps.
ru_ru: Значение имеет вид C<< <I<number>>[m][s][t] >>, где C<I<number>> это количество файловых дескрипторов вы хотите написать в (2 по умолчанию), и комбинации букв указывает, что вы хотите получить информацию о (m)emory (памяти) and/or (s)v (скалятрной переменной), optionally with (t)imestamps (опционально в датой и временем).

source: The value is expressed in hexadecimal, and may include a leading 0x.
ru_ru: Значение выражается в шестнадцатеричном, и может включать лидирующий 0x.

source: The value of C<$Config{sitelib}> is also determined in C code and not read from C<Config.pm>, which is not loaded.
ru_ru: Значение C<$Config{sitelib}> также определяется в коде C и не считывается из C<Config.pm> , который не загружен.

source: The variables are scoped to the block (i.e. a bunch of statements surrounded by curly-braces) in which they are defined.
ru_ru: Переменные находятся в области видимости блока (то есть куча операторов, заключенная в фигурные скобки), в котором они определены.

source: Then use it like:
ru_ru: Затем использовать его как:

source: There are a couple of special arrays too, such as C<@ARGV> (the command line arguments to your script) and C<@_> (the arguments passed to a subroutine).
ru_ru: Есть несколько специальных массивов также, такие как C<@ARGV> (аргументы командной строки в скрипте) и C<@_> (аргументы, передаваемые в подпрограмму).

source: There are a number of "magic" scalars with names that look like punctuation or line noise.
ru_ru: Есть целый ряд "магических" скаляров с именами, которые выглядят как знаки препинания или помехи в линиях.

source: There are many books on Perl and Perl-related.
ru_ru: Есть много книг по Perl и связанных с Perl.

source: There are probably very nice books published after this list was included in your Perl release, and you can check the latest released version at http://perldoc.perl.org/perlbook.html .
ru_ru: Есть, вероятно, очень хорошие книги, изданные после этот список был включен в вашем Perl релиз, и вы можете проверить последней выпущенной версии на http://perldoc.perl.org/perlbook.html.

source: There are some areas where you may want to examine the perl script produced and tweak it some.
ru_ru: Есть некоторые области, где вы можете изучать perl-скрипт, который создает программа и донастроить его при необходимости.

source: There are times when you can move this down past some conditionals that test the entire record so that the split is not done as often.
ru_ru: Есть моменты, когда вы можете двигаться вниз после некоторых условий, которые проверяют всю запись так, что разбиения не будет сделано, как обычно.

source: There is a list of these books, some with extensive reviews, at http://books.perl.org/ .
ru_ru: Существует список этих книг, некоторые из которых имеют обширные обзоры, на http://books.perl.org/.

source: There is an experimental native C layer, which is expected to be enhanced and should eventually become the default under Win32.
ru_ru: Существует экспериментальная родной C слой, который как ожидается, будет повышена и должна в конечном итоге стать по умолчанию под Win32.

source: There is an awk idiom of putting int() around a string expression to force numeric interpretation, even though the argument is always integer anyway.
ru_ru: Существует идиома awk ставить int() вокруг строкового выражения, чтобы сделать преобразование к числу, хотя аргумент всегда целое так или иначе.

source: There is no general solution to all of this.
ru_ru: Здесь нет общего решения на все это.

source: There is no need to pre-declare your variable types, but you have to declare them using the C<my> keyword the first time you use them.
ru_ru: Здесь нет необходимости предварительно объявлять переменную типа, но вы должны объявить их с помощью ключевого слова C<my> ,если вы используете их в первый раз.

source: There is no need to have a C<main()> function or anything of that kind.
ru_ru: Здесь нет необходимости иметь C<main()> функцию или что-нибудь в этом роде.

source: There is only a single C<%^H>, but arbitrarily many modules that want to use its scoping semantics.
ru_ru: Существует только один C<%^H>, но сколь угодно много модулей, которые хотят использовать его обзорного семантики.

source: There's also a negated version of it:
ru_ru: Здесь даже есть негативная версия этого оператора:

source: There's also a negated version, for the same reason we have C<unless>:
ru_ru: Также есть негативная версия, по той же причине у нас есть C<unless> :

source: These statements are simply written in the script in a straightforward fashion.
ru_ru: Эти операторы(statements) просто написаны в сценарии прямым способом.

source: These are documented at great length in L<perlre>, but for the meantime, here's a quick cheat sheet:
ru_ru: Они описаны в достаточно подробно в L<perlre>, но тем не менее, вот быстрая шпаргалка:

source: These are documented in L<perlvar>.
ru_ru: Они описаны в L<perlvar>.

source: These examples often reflect the style and preference of the author of that piece of the documentation, and may be briefer than a corresponding line of code in a real program.
ru_ru: Эти примеры часто отражают стиль и предпочтения автора этой части документации и могут быть короче, чем соответствующая строка кода в реальной программе.

source: These sets of one-liners are equivalent:
ru_ru: Эти наборы однострочников (one-liners) эквивалентны:

source: These special variables are used for all kinds of purposes, and are documented in L<perlvar>.
ru_ru: Эти переменные используются для всех видов целей, и документированы в L<perlvar> .

source: These warnings can now be controlled normally with C<no warnings qw(taint)>.
ru_ru: Этими предупреждениями теперь можно управлять нормально с C<no warnings qw(taint)>.

source: These will often point out exactly where the trouble is.
ru_ru: Они будут часто указывают именно там, где беда.

source: They are only required occasionally to clarify issues of precedence.
ru_ru: Они требуются лишь иногда для прояснения вопросов старшинства операторов.

source: They can be used to capture the results of parts of the regexp match for later use.
ru_ru: Они могут быть использованы для захвата результата части матча регулярного выражения для последующего использования.

source: They check different things so you need both.
ru_ru: Они проверяют разные вещи, так что вам нужны обе строки.

source: They're also supported as operators in their own right.
ru_ru: Они также поддерживаются как операторы в их собственном виде.

source: They're more readable than the C-style operators, but have different precedence to C<&&> and friends.
ru_ru: Они более понятные, чем C-style операторы, но имеют разные предпочтения (старшинство операторов) C<&&> и друзьями.

source: This might be more (or less) convenient, depending on what shell you use.
ru_ru: Возможно, это намного удобней (или наоборот), все зависит от ваших предпочтений.

source: This allows one to specify the I<language code> for the desired language translation.
ru_ru: Этот параметр позволяет использовать перевод документации на том языке, которому соответствует I<код_языка>.

source: This allows you to add a prefix to the backup file, instead of (or in addition to) a suffix:
ru_ru: Это позволяет добавить префикс к файлу резервной копии, вместо (или в дополнение к) суффикса:

source: This avoids the need to use quotes when importing symbols.
ru_ru: Это позволяет избежать необходимости использовать кавычки при импорте символов.

source: This behaviour follows the I<implicit> (and problematic) UTF-8 behaviour of Perl 5.8.0.
ru_ru: Такое поведение следует I<неясно> (и проблематично) UTF-8 поведение Perl 5.8.0.

source: This can be overridden by using the C<#line> directive.
ru_ru: Это может быть переопределено с помощью директивы C<#line>.

source: This document is intended to give you a quick overview of the Perl programming language, along with pointers to further documentation.
ru_ru: Этот документ предназначен, чтобы дать вам краткий обзор языка программирования Perl, а также содержит указатели на дополнительную документацию.

source: This example works on many platforms that have a shell compatible with Bourne shell:
ru_ru: Этот пример работает на многих платформах, которые имеют совместимость с оболочкой Bourne (Bourne shell):

source: This feature was practically unused, however, and the command line switch was therefore "recycled".)
ru_ru: Эта функция практически не используется, однако, и параметр командной строки, поэтому был "отправлен в ведро" ( "recycled").)

source: This flag is automatically set if you include B<-g> option when C<Configure> asks you about optimizer/debugger flags.
ru_ru: Этот флаг устанавливается автоматически, если вы включите B<-g> опцию, когда C<Configure> спрашивает вас об оптимизаторе/отладчике флагов.

source: This functionality is disabled for setuid scripts and for scripts run with B<-T>.
ru_ru: Эта функция отключена для SETUID скрипты и скрипты для запуска с B<-T>.

source: This incantation is a bit much to remember, but Perl will display it for you if you say C<perl "-V:startperl">.
ru_ru: Это заклинание достаточно трудно вспомнить, но Perl отобразит его для вас, если вы говорите, C<perl "-V:startperl">.

source: This introductory document does not aim to be complete.
ru_ru: Этот вводный документ не ставит целью быть полным.

source: This is a hook that allows the sysadmin to customize how Perl behaves.
ru_ru: Это крючок, который позволяет системному администратору настраивать поведение Perl.

source: This is a re-implementation of stdio-like buffering written as a PerlIO layer.
ru_ru: Это вновь осуществления STDIO-подобный буферизации виде слоя PerlIO.

source: This is actually just a wrapper around the C<-M> switch; using C<-oI<formatname>> just looks for a loadable class by adding that format name (with different capitalizations) to the end of different classname prefixes.
ru_ru: На самом деле, это обертка вокруг переключателя C<-M>; используйте C<-oI<название-формата>> для загрузки класса, имя класса формируется добавлением названия формата в конец имени (без учета регистра).

source: This is called an "array slice".
ru_ru: Это называется "срез массива".

source: This is faster than using the B<-exec> switch of I<find> because you don't have to start a process on every filename found.
ru_ru: Это быстрее, чем при использовании опцию B<-exec> у I<find>, потому что вы не должны запускать процесс на каждом найденном файле.

source: This is generally unneeded in perl, but a2p can't tell if the argument is always going to be integer, so it leaves it in.
ru_ru: Это, как правило, не нужно в Perl, но a2p не может сказать, если аргумент всегда будет целое, то он оставляет его целым.

source: This is just the default, with explicit layers in open() and with binmode() one can manipulate streams as usual.
ru_ru: Это просто по умолчанию, с явными слоями (explicit layers) в open() и с binmode () можно управлять потоками, как обычно.

source: This is presumably useful in cases of on/off features like: C<-w page_numbering>.
ru_ru: Предположительно, это удобно в переключателях да/нет таких, как: C<-w номер_страницы>.

source: This is provided as a more readable version of C<if (!I<condition>)>.
ru_ru: Это считается более читаемой версией C<if (!I<condition>).

source: This is really helpful if you're working inside of a build directory and want to read through the docs even if you have a version of a module previously installed.
ru_ru: Это очень полезно, если вы работаете внутри каталог сборки и хотите прочитать документацию, даже если у вас есть версия модулем, установленным ранее.

source: This is slightly bizarre, but it helps people on machines that don't do C<#!>, because they can tell a program that their SHELL is F</usr/bin/perl>, and Perl will then dispatch the program to the correct interpreter for them.
ru_ru: Это немного странно, но это помогает людям на машинах, у которых нет C<#!>, потому что они могут сказать, что их программа SHELL есть F</usr/bin/perl> И Perl затем отправляет программу для корректной обработки интерпретатором.

source: This is the default mode for perl.
ru_ru: Это режим по умолчанию для Perl.

source: This is useful for running a program embedded in a larger message.
ru_ru: Это полезно для запуска программы включенной в большое сообщение.

source: This layer provides a PerlIO interface by wrapping system's ANSI C "stdio" library calls.
ru_ru: Этот уровень предоставляет PerlIO интерфейс, обернув системе ANSI C "STDIO" вызовы библиотеки.

source: This may be faster, but it probably won't look as nice.
ru_ru: Возможно, это быстрей, но, вероятно, будет смотреться хуже.

source: This may be useful if the docs don't explain a function in the detail you need, and you'd like to inspect the code directly; perldoc will find the file for you and simply hand it off for display.
ru_ru: Это может быть полезно, если документация не достаточно объясняет работу функции и Вы хотите посмотреть непосредственно код; perldoc найдет файл для Вас и просто выведет содержимое.

source: This poses a problem for content such as book lists.
ru_ru: Это создает проблему для содержания таких книг, которые приведены в списке.

source: This release (5.14) uses C<unix> as the bottom layer on Win32, and so still uses the C compiler's numeric file descriptor routines.
ru_ru: Этот релиз (5.14) использует C<unix> в качестве нижнего слоя на Win32, и так до сих пор использует компилятора C. числовые процедуры дескриптор файла.

source: This sets C<$\> to newline and then sets C<$/> to the null character.
ru_ru: Этот параметр определяет, C<$\> как символ новой строки, а затем устанавливает C<$/> в нулевой символ.

source: This specifies an option to call the formatter B<w>ith.
ru_ru: Этот параметр позволяет вызвать форматирование с B<п>араметрами.

source: This specifies that the output is not to be sent to a pager, but is to be sent directly to STDOUT.
ru_ru: Это указывает, что вывод не для отправки на страницу, но можно получить непосредственно на стандартный вывод (STDOUT).

source: This specifies that the output is to be sent neither to a pager nor to STDOUT, but is to be saved to the specified filename.
ru_ru: Этот параметр позволяет сохранить вывод в файл, не выводя на страницу или в STDOUT.

source: This specifies that you want Perldoc to try using a Pod-formatting class for the output format that you specify.
ru_ru: Используйте этот параметр, если вы хотите, чтобы Perldoc попытался использовать класс POD-форматирования в качестве выходного формата.

source: This specifies the module that you want to try using for formatting the pod.
ru_ru: С помощью этого параметра можно указать модуль, с помощью которого Вы хотите форматировать POD-документацию.

source: This speeds startup at the expense of some disk space (which you can minimize by stripping the executable).
ru_ru: Это ускоряет запуск за счет некоторого дискового пространства (которое можно свести к минимуму путем удаления исполняемого файла).

source: This switch causes Perl to dump core after compiling your program.
ru_ru: Этот выключатель принуждает Perl сваливать ядро ​​в дамп после компиляции программы (This switch causes Perl to dump core after compiling your program.).

source: This switch really just enables the global C<$^W> variable; normally, the lexically scoped C<use warnings> pragma is preferred.
ru_ru: Этот переключатель позволяет включить только глобальную C<$^W> переменную, обычно, лексически C<use warnings> Pragma является предпочтительной.

source: This uses C<caller()> to determine the value of C<$^H{"myint/in_effect"}> when each line of the user's script was called, and therefore provide the correct semantics in the subroutine implementing the overloaded addition.
ru_ru: Здесь используется C<caller()>, чтобы определить значение C<$^H{"myint/in_effect"}>, когда каждая строка пользовательского скрипта была вызвана. Поэтому в подпрограмме, реализующей перегрузку оператора сложения, используется корректная семантика.

source: This variable is set during Perl startup and is thereafter read-only.
ru_ru: Эта переменная устанавливается во время запуска Perl и после этого она доступна только для чтения.

source: This will let you name the fields throughout the script.
ru_ru: Это позволит вам переименовывать поля во всем сценарии.

source: This works only if there are no filename arguments--to pass arguments to a STDIN-read program you must explicitly specify a "-" for the program name.
ru_ru: Это работает только тогда, когда в качестве аргумента нет имени файла - для передачи аргументов на STDIN (стандартный ввод/input) чтения программы необходимо явно указать "-" для имени программы.

source: This, combined with L</PERL_HASH_SEED> and L</PERL_PERTURB_KEYS> is intended to aid in debugging nondeterministic behaviour caused by hash randomization.
ru_ru: Это, в сочетании с L</PERL_HASH_SEED> и L</PERL_PERTURB_KEYS> предназначена для помощи в отладке недетерминированное поведение вызвано хэш рандомизации.
